In [1]:
import pandas as pd

In [2]:
data = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [3]:
myD = {
    'e' : 20,
    'f' : 200,
    'g' : 2000,
    'h' : 15
}

In [4]:
pd.Series(myD)

e      20
f     200
g    2000
h      15
dtype: int64

# Video 2

In [5]:
from numpy.random import randn

In [6]:
myData = randn(3,4)

In [7]:
myDataFrame = pd.DataFrame(myData, ['R1','R2','R3'], ['C1','C2','C3','C4'])

In [8]:
myDataFrame

          C1        C2        C3        C4
R1 -0.054549  0.609252  0.434681  0.161437
R2  0.113197  0.051804 -0.753745  0.812732
R3 -0.040937 -1.334837  1.260936 -0.202305

In [9]:
myDataFrame[['C1']]

          C1
R1 -0.054549
R2  0.113197
R3 -0.040937

In [10]:
myDataFrame['C5'] = myDataFrame['C3'] * myDataFrame['C4']

In [11]:
myDataFrame

          C1        C2        C3        C4        C5
R1 -0.054549  0.609252  0.434681  0.161437  0.070173
R2  0.113197  0.051804 -0.753745  0.812732 -0.612593
R3 -0.040937 -1.334837  1.260936 -0.202305 -0.255094

In [12]:
del myDataFrame['C5']

In [13]:
myDataFrame[['C4']]

          C4
R1  0.161437
R2  0.812732
R3 -0.202305

In [21]:

myDataFrame.loc[['R1','R2'],['C3','C4']]

          C3        C4
R1  0.434681  0.161437
R2 -0.753745  0.812732

In [23]:
myDataFrame[myDataFrame['C3'] > 0]

          C1        C2        C3        C4
R1 -0.054549  0.609252  0.434681  0.161437
R3 -0.040937 -1.334837  1.260936 -0.202305